In [2]:
import numpy as np
import pandas as pd

In [4]:
data = pd.Series([0.25,0.5,0.75,1.0]) # pandas series object
data

0    0.25
1    0.50
2    0.75
3    1.00
4    0.00
dtype: float64

In [5]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
data[1]

0.5

In [8]:
data[1:3]

1    0.50
2    0.75
dtype: float64

series as generalized numpy array

In [10]:
data=pd.Series([0.25,0.5,0.75,1.0],
              index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [11]:
data=pd.Series([0.25,0.5,0.75,1.0],
              index=[2,5,3,7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [12]:
data[5]

0.5

series as specialized dictionary

In [13]:
population_dict = {
    'kochi' : 38332521,
    'Trivandrum' : 26448193,
    'Calicut' : 19651127,
    'Quilon' : 19552823,
}
population = pd.Series(population_dict)
population

kochi         38332521
Trivandrum    26448193
Calicut       19651127
Quilon        19552823
dtype: int64

In [16]:
pd.Series(data, index=index)

NameError: name 'index' is not defined

In [17]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [19]:
pd.Series({2:'a',1:'b',3:'c'})

2    a
1    b
3    c
dtype: object

In [20]:
pd.Series({2:'a',1:'b',3:'c'}, index=[3,2])

3    c
2    a
dtype: object

In [21]:
area_dict={
    'kochi' : 38332521,
    'Trivandrum' : 26448193,
    'Calicut' : 19651127,
}
area=pd.Series(area_dict)
area

kochi         38332521
Trivandrum    26448193
Calicut       19651127
dtype: int64

In [24]:
Area=pd.Series({
    'kochi' : 38332521,
    'Trivandrum' : 26448193,
    'Calicut' : 19651127,
})
places= pd.DataFrame({'population' : population, 'Area' : Area})
print(places)

            population        Area
Calicut       19651127  19651127.0
Quilon        19552823         NaN
Trivandrum    26448193  26448193.0
kochi         38332521  38332521.0

In [25]:
type(places)

pandas.core.frame.DataFrame

In [26]:
places.index

Index(['Calicut', 'Quilon', 'Trivandrum', 'kochi'], dtype='object')

In [27]:
places.columns

Index(['population', 'Area'], dtype='object')

In [47]:
df_scores=pd.DataFrame({           
    'Test1' : [88,89,90,91,92],
    'Test2' : [84,85,86,87,88]},
    index = ['depu','jaison','sudeesh','shafek','ajmi'])

print(df_scores)

         Test1  Test2
depu        88     84
jaison      89     85
sudeesh     90     86
shafek      91     87
ajmi        92     88

In [41]:
print(df_scores.max()) #apply the maximum function to find max score

Test1    92
Test2    88
dtype: int64

In [42]:
print(df_scores.mean()) # apply the mean function to find avg score

Test1    90.0
Test2    86.0
dtype: float64

In [50]:
print(df_scores.std()) #apply standard deviation

Test1    1.581139
Test2    1.581139
dtype: float64

In [52]:
df_scores.describe()

           Test1      Test2
count   5.000000   5.000000
mean   90.000000  86.000000
std     1.581139   1.581139
min    88.000000  84.000000
25%    89.000000  85.000000
50%    90.000000  86.000000
75%    91.000000  87.000000
max    92.000000  88.000000

In [53]:
df_scores.head()

         Test1  Test2
depu        88     84
jaison      89     85
sudeesh     90     86
shafek      91     87
ajmi        92     88

In [54]:
df_scores.tail()

         Test1  Test2
depu        88     84
jaison      89     85
sudeesh     90     86
shafek      91     87
ajmi        92     88

In [57]:
df_scores.head(2)
df_scores.tail(2)

        Test1  Test2
shafek     91     87
ajmi       92     88

In [60]:
ind=pd.Index([2,3,5,7,11])
print(ind)
print(ind[1])
print(ind[2:4])

Index([2, 3, 5, 7, 11], dtype='int64')
3
Index([5, 7], dtype='int64')